       Router(config)#int
Router(config)#interface fa1/0
Router(config-if)#ip add
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#exit
Router(config)#








Router con0 is now available






Press RETURN to get started.













Router>
Router>
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa0/0
Router(config-if)#mo shutdown
                   ^
% Invalid input detected at '^' marker.
	
Router(config-if)#nmo shutdown
                   ^
% Invalid input detected at '^' marker.
	
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
exit
Router(config)#int fa0/1
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up
exit
Router(config)#int fa1/0
Router(config-if)#no sh
Router(config-if)#no shutdown 

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet1/0, changed state to up
exit
Router(config)#wr mem
               ^
% Invalid input detected at '^' marker.
	
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#wr mem
Building configuration...
[OK]
Router#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up









Router con0 is now available






Press RETURN to get started.












%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to up


Router>en
Router#router rip
              ^
% Invalid input detected at '^' marker.
	
Router#router 
Translating "router"...domain server (255.255.255.255)
% Unknown command or computer name, or unable to find computer address

Router#router ?
% Unrecognized command
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router ?
  bgp    Border Gateway Protocol (BGP)
  eigrp  Enhanced Interior Gateway Routing Protocol (EIGRP)
  ospf   Open Shortest Path First (OSPF)
  rip    Routing Information Protocol (RIP)
Router(config)#router rip
Router(config-router)#?
  auto-summary         Enter Address Family command mode
  default-information  Control distribution of default information
  distance             Define an administrative distance
  exit                 Exit from routing protocol configuration mode
  network              Enable routing on an IP network
  no                   Negate a command or set its defaults
  passive-interface    Suppress routing updates on an interface
  redistribute         Redistribute information from another routing protocol
  timers               Adjust routing timers
  version              Set routing protocol version
Router(config-router)#net
Router(config-router)#network 
% Incomplete command.
Router(config-router)#network ?
  A.B.C.D  Network number
Router(config-router)#ver
Router(config-router)#version 2
Router(config-router)#net 192.168.1.0
Router(config-router)#net 192.168.10.0
Router(config-router)#net 10.8.1.0
Router(config-router)#show ip route
                      ^
% Invalid input detected at '^' marker.
	
Router(config-router)#exit
Router(config)#show ip route
                ^
% Invalid input detected at '^' marker.
	
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#show ip route
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
R       10.0.0.0/8 [120/2] via 192.168.10.2, 00:00:49, FastEthernet0/0
C       10.8.1.0/24 is directly connected, FastEthernet0/1
C    192.168.1.0/24 is directly connected, FastEthernet1/0
R    192.168.2.0/24 [120/1] via 192.168.10.2, 00:00:28, FastEthernet0/0
R    192.168.3.0/24 [120/1] via 10.8.1.2, 00:00:21, FastEthernet0/1
     192.168.10.0/24 is variably subnetted, 3 subnets, 2 masks
R       192.168.10.0/24 is possibly down, routing via 10.8.1.2, FastEthernet0/1
C       192.168.10.0/30 is directly connected, FastEthernet0/0
R       192.168.10.4/30 [120/1] via 192.168.10.2, 00:00:28, FastEthernet0/0

Router#show ip int brief
Interface              IP-Address      OK? Method Status                Protocol 
FastEthernet0/0        192.168.10.1    YES manual up                    up 
FastEthernet0/1        10.8.1.1        YES manual up                    up 
FastEthernet1/0        192.168.1.1     YES manual up                    up 
FastEthernet1/1        unassigned      YES unset  administratively down down 
Vlan1                  unassigned      YES unset  administratively down down
Router#wr mem
Building configuration...
[OK]
Router#
Router#